In [8]:
def cr_etl(cr_list):
    """This function takes credit records list and flattens all data to one row per client. The following format applies:
    ID = id of the client, MB= list of months for a client, STS list of statuses for a given client"""
    #Initialisig ID, MB, STS list with first values so further values can be appended
    ID=int(cr_list[0]['ID'])    
    MB=[]
    MB.append(int(cr_list[0]['MONTHS_BALANCE']))
    STS=[]
    STS.append(cr_list[0]['STATUS'])

    flat_cr_list=[]
    for i in range(1,len(cr_list)):
        if cr_list[i]['ID']==cr_list[i-1]['ID']:
            #print(i, cr_list[i]['MONTHS_BALANCE'],type(MB),cr_list[i]['STATUS'],type(STS))
            MB.append(int(cr_list[i]['MONTHS_BALANCE']))
            STS.append(cr_list[i]['STATUS'])
        else: 
            temp=list(dict.fromkeys(STS))
            flat_cr_list.append([ID,MB,STS])
            ID=int(cr_list[i]['ID'])
            MB=[]
            MB.append(int(cr_list[i]['MONTHS_BALANCE']))
            STS=[]
            STS.append(cr_list[i]['STATUS'])
    return flat_cr_list

In [33]:
import csv
file=open('C:\\Users\\User\\OneDrive\\Desktop\\Kurs\\Projekt\\Python\\Dane\\credit_record.csv') #open file credit records
credit_records_list=list((csv.DictReader(file))) #import all rows into a list of corresponding dictionaries. 
file.close()

import pandas as pd
credit_records=pd.DataFrame(cr_etl(credit_records_list),columns=["ID","MONTHS_BALANCE","STATUS"]) #this takes credit list, makes it flat i.e. one "row" for one client and then turns it into a dataframe

file=open('C:\\Users\\User\\OneDrive\\Desktop\\Kurs\\Projekt\\Python\\Dane\\application_record.csv') #open file application records
application_redords=pd.read_csv(file) #import application records directly to a dataframe named application_records
file.close()

In [25]:
#One can now read credit data in its original form (below will show history for 2 clients)
credit_records_list[0:4]

[{'ID': '5001711', 'MONTHS_BALANCE': '0', 'STATUS': 'X'},
 {'ID': '5001711', 'MONTHS_BALANCE': '-1', 'STATUS': '0'},
 {'ID': '5001711', 'MONTHS_BALANCE': '-2', 'STATUS': '0'},
 {'ID': '5001711', 'MONTHS_BALANCE': '-3', 'STATUS': '0'}]

In [30]:
#or in aggreagated per client form both months balance and status are from most recent month to the oldest month
credit_records[0:1]

        ID   MONTHS_BALANCE        STATUS
0  5001711  [0, -1, -2, -3]  [X, 0, 0, 0]

In [35]:
#application data can be viewed as dataform too
application_redords[0:2]

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0